zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  initStep_ = "set_device_name";
  err = esp_bt_dev_set_device_name(BT_DEVICE_NAME);
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN set_device_name failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "hid_callback";
  err = esp_bt_hid_device_register_callback(
      reinterpret_cast<esp_hd_cb_t>(&ClassicBtControllerTransport::onHidEvent));
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN hid_register_callback failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "hid_init";
  err = esp_bt_hid_device_init();
  if (err != ESP_OK) {
    initError_ = esp_err_to_name(err);
    Serial.printf("WARN hid_init failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  initStep_ = "hid_init_requested";
  initError_ = "ESP_OK";

#if (CONFIG_BT_SSP_ENABLED == true)
  esp_bt_sp_param_t paramType = ESP_BT_SP_IOCAP_MODE;
  esp_bt_io_cap_t ioCap = ESP_BT_IO_CAP_NONE;
  err = esp_bt_gap_set_security_param(paramType, &ioCap, sizeof(ioCap));
  if (err != ESP_OK) {
    Serial.printf("WARN bt set_security_param failed err=%s\n", esp_err_to_name(err));
  }
#endif

  esp_bt_pin_type_t pinType = ESP_BT_PIN_TYPE_VARIABLE;
  esp_bt_pin_code_t pinCode = {};
  err = esp_bt_gap_set_pin(pinType, 0, pinCode);
  if (err != ESP_OK) {
    Serial.printf("WARN bt set_pin failed err=%s\n", esp_err_to_name(err));
  }

  Serial.printf(
      "INFO bt init requested name=\"%s\" provider=\"%s\" desc=\"%s\"\n",
      BT_DEVICE_NAME,
      BT_DEVICE_PROVIDER,
      BT_DEVICE_DESCRIPTION);
  return true;
}

void ClassicBtControllerTransport::clearConnectionState() {
  discoverable_ = false;
  connected_ = false;
  readyForReports_ = false;
  authComplete_ = false;
  pairingComplete_ = false;
  paired_ = false;
  hidReady_ = false;
  appRegistered_ = false;
  gapReady_ = false;
  bluedroidReady_ = false;
  stackStarted_ = false;
  timer_ = 0;
  explicitInputActive_ = false;
  initStep_ = "idle";
  initError_ = "none";
  ignoredReportCount_ = 0;
  lastIgnoredReportId_ = 0;
  lastIgnoredReportLen_ = 0;
  lastAclDisconnectReason_ = 0;
  lastHidCloseStatus_ = -1;
  lastHidCloseConnStatus_ = -1;
  lastSendReportStatus_ = -1;
  lastSendReportReason_ = 0;
  lastSendReportId_ = 0;
  reportCongested_ = false;
  consecutiveSendReportFailures_ = 0;
  sendReportFailureCount_ = 0;
  lastDropReason_ = "none";
}

bool ClassicBtControllerTransport::shutdownClassicBluetooth() {
  initStep_ = "shutdown";
  initError_ = "none";
  readyForReports_ = false;

  const esp_err_t scanErr =
      esp_bt_gap_set_scan_mode(ESP_BT_NON_CONNECTABLE, ESP_BT_NON_DISCOVERABLE);
  if (!isIgnorableBluetoothError(scanErr)) {
    Serial.printf("WARN bt shutdown scan_mode err=%s\n", esp_err_to_name(scanErr));
  }

  const esp_err_t unplugErr = esp_bt_hid_device_virtual_cable_unplug();
  if (!isIgnorableBluetoothError(unplugErr)) {
    Serial.printf("WARN bt shutdown vc_unplug err=%s\n", esp_err_to_name(unplugErr));
  }
  delay(200);

  const esp_err_t disconnectErr = esp_bt_hid_device_disconnect();
  if (!isIgnorableBluetoothError(disconnectErr)) {
    Serial.printf("WARN bt shutdown disconnect err=%s\n", esp_err_to_name(disconnectErr));
  }
  delay(200);

  const esp_err_t unregisterErr = esp_bt_hid_device_unregister_app();
  if (!isIgnorableBluetoothError(unregisterErr)) {
    Serial.printf("WARN bt shutdown unregister_app err=%s\n", esp_err_to_name(unregisterErr));
  }
  delay(150);

  const esp_err_t hidDeinitErr = esp_bt_hid_device_deinit();
  if (!isIgnorableBluetoothError(hidDeinitErr)) {
    Serial.printf("WARN bt shutdown hid_deinit err=%s\n", esp_err_to_name(hidDeinitErr));
  }
  delay(150);

  const esp_err_t bluedroidDisableErr = esp_bluedroid_disable();
  if (!isIgnorableBluetoothError(bluedroidDisableErr)) {
    Serial.printf("WARN bt shutdown bluedroid_disable err=%s\n", esp_err_to_name(bluedroidDisableErr));
  }

  const esp_err_t bluedroidDeinitErr = esp_bluedroid_deinit();
  if (!isIgnorableBluetoothError(bluedroidDeinitErr)) {
    Serial.printf("WARN bt shutdown bluedroid_deinit err=%s\n", esp_err_to_name(bluedroidDeinitErr));
  }

  if (btStarted() && !btStop()) {
    Serial.println("WARN bt shutdown btStop failed");
  }

  clearConnectionState();
  clearInputs();
  delay(250);
  return true;
}

void ClassicBtControllerTransport::clearInputs() {
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;
  leftStickX_ = kStickCenter;
  leftStickY_ = kStickCenter;
  rightStickX_ = kStickCenter;
  rightStickY_ = kStickCenter;

  std::memset(report30_, 0, sizeof(report30_));
  report30_[1] = 0x8E;
  report30_[11] = 0x80;

  const uint8_t defaultDummy[] = {0x00, 0x8E, 0x00, 0x00, 0x00, 0x00,
                                  0x08, 0x80, 0x00, 0x08, 0x80};
  std::memcpy(dummyReport_, defaultDummy, sizeof(dummyReport_));
  updateInputReport();
}

void ClassicBtControllerTransport::setButtonBits(uint32_t buttonsMask) {
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;

  if ((buttonsMask & controllerButtonMask(ControllerButton::Y)) != 0) {
    buttonsRight_ |= 1u << 0;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::X)) != 0) {
    buttonsRight_ |= 1u << 1;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::B)) != 0) {
    buttonsRight_ |= 1u << 2;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::A)) != 0) {
    buttonsRight_ |= 1u << 3;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::R)) != 0) {
    buttonsRight_ |= 1u << 6;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::ZR)) != 0) {
    buttonsRight_ |= 1u << 7;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::L)) != 0) {
    buttonsLeft_ |= 1u << 6;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::ZL)) != 0) {
    buttonsLeft_ |= 1u << 7;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadDown)) != 0) {
    buttonsLeft_ |= 1u << 0;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadUp)) != 0) {
    buttonsLeft_ |= 1u << 1;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadRight)) != 0) {
    buttonsLeft_ |= 1u << 2;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::DpadLeft)) != 0) {
    buttonsLeft_ |= 1u << 3;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Minus)) != 0) {
    buttonsShared_ |= 1u << 0;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Plus)) != 0) {
    buttonsShared_ |= 1u << 1;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::RStick)) != 0) {
    buttonsShared_ |= 1u << 2;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::LStick)) != 0) {
    buttonsShared_ |= 1u << 3;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Home)) != 0) {
    buttonsShared_ |= 1u << 4;
  }
  if ((buttonsMask & controllerButtonMask(ControllerButton::Capture)) != 0) {
    buttonsShared_ |= 1u << 5;
  }
}

void ClassicBtControllerTransport::setLeftStickFromVector(int x, int y) {
  leftStickX_ = x < 0 ? kStickMin : (x > 0 ? kStickMax : kStickCenter);
  leftStickY_ = y < 0 ? kStickMax : (y > 0 ? kStickMin : kStickCenter);
  rightStickX_ = kStickCenter;
  rightStickY_ = kStickCenter;
}

void ClassicBtControllerTransport::updateInputReport() {
  report30_[0] = timer_;
  report30_[2] = buttonsRight_;
  report30_[3] = buttonsShared_;
  report30_[4] = buttonsLeft_;
  report30_[5] = static_cast<uint8_t>((leftStickX_ << 4) & 0xF0);
  report30_[6] = static_cast<uint8_t>((leftStickX_ & 0xF0) >> 4);
  report30_[7] = leftStickY_;
  report30_[8] = static_cast<uint8_t>((rightStickX_ << 4) & 0xF0);
  report30_[9] = static_cast<uint8_t>((rightStickX_ & 0xF0) >> 4);
  report30_[10] = rightStickY_;

  dummyReport_[0] = timer_;
}

void ClassicBtControllerTransport::ensureSendTask() {
  if (sendTaskHandle_ != nullptr) {
    return;
  }

  xTaskCreatePinnedToCore(
      &ClassicBtControllerTransport::sendTaskTrampoline,
      "switch_send_task",
      4096,
      this,
      2,
      &sendTaskHandle_,
      0);
}

uint16_t ClassicBtControllerTransport::idleSendIntervalMs() const {
  if (!connected_ && !paired_) {
    return kIdleDisconnectedReportIntervalMs;
  }

  if (reportCongested_ || consecutiveSendReportFailures_ >= 3) {
    return kIdleCongestedReportIntervalMs;
  }

