zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  if (!paired_ || !authComplete_) {
    return kIdlePrePairingReportIntervalMs;
  }

  return kIdleConnectedReportIntervalMs;
}

void ClassicBtControllerTransport::sendTaskTrampoline(void *param) {
  auto *transport = static_cast<ClassicBtControllerTransport *>(param);
  while (true) {
    if (!transport->explicitInputActive_) {
      transport->sendCurrentInputReport(false);
    }
    vTaskDelay(pdMS_TO_TICKS(transport->idleSendIntervalMs()));
  }
}

bool ClassicBtControllerTransport::pressButtons(
    uint32_t buttonsMask, uint16_t holdMs, uint16_t settleMs) {
  explicitInputActive_ = true;
  setButtonBits(buttonsMask);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  explicitInputActive_ = false;
  return ok;
}

bool ClassicBtControllerTransport::moveDirection(
    int x, int y, uint16_t holdMs, uint16_t settleMs) {
  explicitInputActive_ = true;
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;
  setLeftStickFromVector(x, y);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  explicitInputActive_ = false;
  return ok;
}

bool ClassicBtControllerTransport::resetConnection() {
  Serial.println("INFO bt reset requested mode=stack-restart");

  shutdownClassicBluetooth();

  clearInputs();

  if (!initializeClassicBluetooth()) {
    Serial.printf("WARN bt reset restart failed step=%s err=%s\n", initStep_, initError_);
    return false;
  }

  Serial.println("INFO bt reset completed mode=stack-restart");
  return true;
}

void ClassicBtControllerTransport::enterReconnectableState(const char *reason) {
  connected_ = false;
  readyForReports_ = false;
  authComplete_ = false;
  pairingComplete_ = false;
  paired_ = false;
  discoverable_ = true;
  reportCongested_ = false;
  consecutiveSendReportFailures_ = 0;
  lastDropReason_ = reason;
  clearInputs();

  esp_err_t err = ESP_OK;
  if (gapReady_ && appRegistered_) {
    err = esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
    discoverable_ = err == ESP_OK;
  }

  Serial.printf(
      "INFO bt reconnectable reason=%s discoverable=%s err=%s\n",
      reason,
      boolName(discoverable_),
      esp_err_to_name(err));
}

void ClassicBtControllerTransport::printStatus(Print &output) const {
  output.println("INFO bt_mode=classic-bt-hid");
  output.println("INFO bt_profile=uartswitchcon-pro-controller");
  output.print("INFO bt_stack_started=");
  output.println(boolName(stackStarted_));
  output.print("INFO bt_bluedroid_ready=");
  output.println(boolName(bluedroidReady_));
  output.print("INFO bt_gap_ready=");
  output.println(boolName(gapReady_));
  output.print("INFO bt_hid_ready=");
  output.println(boolName(hidReady_));
  output.print("INFO bt_app_registered=");
  output.println(boolName(appRegistered_));
  output.print("INFO bt_discoverable=");
  output.println(boolName(discoverable_));
  output.print("INFO bt_connected=");
  output.println(boolName(connected_));
  output.print("INFO bt_auth_complete=");
  output.println(boolName(authComplete_));
  output.print("INFO bt_pairing_complete=");
  output.println(boolName(pairingComplete_));
  output.print("INFO bt_paired=");
  output.println(boolName(paired_));
  output.print("INFO bt_ready_for_reports=");
  output.println(boolName(isControllerInputReady()));
  output.print("INFO bt_init_step=");
  output.println(initStep_);
  output.print("INFO bt_init_error=");
  output.println(initError_);
  output.print("INFO bt_last_drop_reason=");
  output.println(lastDropReason_);
  output.print("INFO bt_ignored_report_count=");
  output.println(ignoredReportCount_);
  output.print("INFO bt_last_ignored_report=");
  output.print(lastIgnoredReportId_);
  output.print("/");
  output.println(lastIgnoredReportLen_);
  output.print("INFO bt_last_acl_disconnect_reason=");
  output.println(lastAclDisconnectReason_);
  output.print("INFO bt_last_hid_close_status=");
  output.println(lastHidCloseStatus_);
  output.print("INFO bt_last_hid_close_conn_status=");
  output.println(lastHidCloseConnStatus_);
  output.print("INFO bt_send_report_failures=");
  output.println(sendReportFailureCount_);
  output.print("INFO bt_last_send_report_status=");
  output.println(lastSendReportStatus_);
  output.print("INFO bt_last_send_report_reason=");
  output.println(lastSendReportReason_);
  output.print("INFO bt_last_send_report_id=");
  output.println(lastSendReportId_);

  if (hasPeerAddress_) {
    output.print("INFO bt_last_peer=");
    output.println(formatBluetoothAddress(lastPeerAddress_));
  }
}

const char *ClassicBtControllerTransport::name() const { return CONTROL_TRANSPORT; }

bool ClassicBtControllerTransport::isHidReportChannelOpen() const {
  return connected_ && appRegistered_ && hidReady_;
}

bool ClassicBtControllerTransport::isControllerInputReady() const {
  return isHidReportChannelOpen() && paired_;
}

bool ClassicBtControllerTransport::sendCurrentInputReport(bool logFailure) {
  readyForReports_ = isHidReportChannelOpen();

  if (!readyForReports_) {
    if (logFailure) {
      Serial.printf("WARN bt report skipped reason=not-ready connected=%s paired=%s\n",
                    boolName(connected_),
                    boolName(paired_));
    }
    return false;
  }

  updateInputReport();

  const bool shouldSendFullReport = connected_ || paired_;
  const uint8_t *payload = shouldSendFullReport ? report30_ : dummyReport_;
  const size_t payloadLength = shouldSendFullReport ? sizeof(report30_) : sizeof(dummyReport_);

  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      0x30,
      payloadLength,
      const_cast<uint8_t *>(payload));
  if (err != ESP_OK) {
    sendReportFailureCount_ += 1;
    if (consecutiveSendReportFailures_ < UINT8_MAX) {
      consecutiveSendReportFailures_ += 1;
    }
    lastSendReportStatus_ = static_cast<int>(err);
    lastSendReportReason_ = 0;
    lastSendReportId_ = 0x30;
    readyForReports_ = isHidReportChannelOpen();
    if (logFailure) {
      Serial.printf(
          "WARN bt send_report failed err=%s connected=%s fail_count=%lu\n",
          esp_err_to_name(err),
          boolName(connected_),
          static_cast<unsigned long>(sendReportFailureCount_));
    }
    return false;
  }

  timer_ = static_cast<uint8_t>(timer_ + 1);
  return true;
}

bool ClassicBtControllerTransport::shouldRetryAfterTransientSendFailure() const {
  return reportCongested_ && isHidReportChannelOpen() && paired_;
}

bool ClassicBtControllerTransport::repeatCurrentInputReport(
    uint16_t durationMs, bool logFailure) {
  const uint32_t startedAt = millis();
  uint32_t congestionStartedAt = 0;
  bool loggedCongestionRetry = false;

  while (true) {
    // Prefer the synchronous send result, but tolerate a brief burst of HID
    // congestion before declaring the controller link unusable.
    if (!sendCurrentInputReport(logFailure)) {
      if (shouldRetryAfterTransientSendFailure()) {
        if (congestionStartedAt == 0) {
          congestionStartedAt = millis();
        }

        if (!loggedCongestionRetry && logFailure) {
          loggedCongestionRetry = true;
          Serial.printf(
              "WARN bt send_report congested retry_window=%u\n",
              kHidCongestionRetryBudgetMs);
        }

        if ((millis() - congestionStartedAt) < kHidCongestionRetryBudgetMs) {
          delay(kHidCongestionRetryDelayMs);
          continue;
        }
      }

